## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                 NAME                 |
|--------|--------------------------------------|
| add    | `aws_alb_listener_rule.security_txt` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_alb_listener_rule.security_txt will be created
  + resource "aws_alb_listener_rule" "security_txt" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:listener/app/ai-answers-lb/054264388446064f/9f4e1b4b69a68aad"
      + priority     = 1
      + tags         = {
          + "CostCentre" = "ai-answers-staging"
          + "Terraform"  = "true"
        }
      + tags_all     = {
          + "CostCentre" = "ai-answers-staging"
          + "Terraform"  = "true"
        }

      + action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = <<-EOT
                    Contact: mailto:ZZTBSCYBERS@tbs-sct.gc.ca
                    Contact: https://hackerone.com/tbs-sct/
                    Canonical: https://cdssandbox.xyz/.well-known/security.txt
                    Expires: 2026-03-02T12:00:00.000Z
                    Preferred-Languages: en, fr
                EOT
              + status_code  = "200"
            }
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/.well-known/security.txt",
                ]
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
